STATIONS: dict[str, list[str]] = {
    "gakkentoshi": [
        "平城山", "木津", "西木津", "祝園", "下狛", "ＪＲ三山木", "同志社前", "京田辺", "大住", "松井山手",
        "長尾", "藤阪", "津田", "河内磐船", "星田", "寝屋川公園", "忍ケ丘", "四条畷", "野崎", "住道",
        "鴻池新田", "徳庵", "放出", "鴫野", "京橋", "大阪城北詰",
    ],
    "hanwahagoromo": [
        "新今宮", "天王寺", "美章園", "南田辺", "鶴ケ丘", "長居", "我孫子町", "杉本町", "浅香", "堺市",
        "三国ケ丘", "百舌鳥", "上野芝", "津久野", "鳳", "東羽衣", "富木", "北信太", "信太山", "和泉府中",
        "久米田", "下松", "東岸和田", "東貝塚", "和泉橋本", "東佐野", "熊取", "日根野", "長滝", "新家",
        "和泉砂川", "和泉鳥取", "山中渓", "紀伊", "六十谷", "紀伊中ノ島", "和歌山",
    ],
    "hokurikubiwako": [
        "新疋田", "近江塩津", "余呉", "木ノ本", "高月", "河毛", "虎姫", "長浜", "田村", "坂田",
        "米原", "彦根", "南彦根", "河瀬", "稲枝", "能登川", "安土", "近江八幡", "篠原", "野洲",
        "守山", "栗東", "草津", "南草津", "瀬田", "石山", "膳所", "大津", "山科", "京都", "西大路",
    ],
    "kobesanyo": [
        "新大阪", "大阪", "塚本", "尼崎", "立花", "甲子園口", "西宮", "さくら夙川", "芦屋", "甲南山手",
        "摂津本山", "住吉", "六甲道", "摩耶", "灘", "三ノ宮", "元町", "神戸", "兵庫", "新長田",
        "鷹取", "須磨海浜公園", "須磨", "塩屋", "垂水", "舞子", "朝霧", "明石", "西明石", "大久保",
        "魚住", "土山", "東加古川", "加古川", "宝殿", "曽根", "ひめじ別所", "御着", "東姫路", "姫路",
        "英賀保", "はりま勝原", "網干", "竜野", "相生", "有年", "上郡", "三石",
    ],
    "kosei": [
        "新疋田", "近江塩津", "永原", "マキノ", "近江中庄", "近江今津", "新旭", "安曇川", "近江高島", "北小松",
        "近江舞子", "比良", "志賀", "蓬莱", "和邇", "小野", "堅田", "おごと温泉", "比叡山坂本", "唐崎",
        "大津京", "山科", "京都", "西大路",
    ],
    "kyoto": [
        "山科", "京都", "西大路", "桂川", "向日町", "長岡京", "山崎", "島本", "高槻", "摂津富田",
        "ＪＲ総持寺", "茨木", "千里丘", "岸辺", "吹田", "東淀川", "新大阪", "大阪", "塚本",
    ],
    "nara": [
        "京都", "東福寺", "稲荷", "JR藤森", "桃山", "六地蔵", "木幡", "黄檗", "宇治", "JR小倉",
        "新田", "城陽", "長池", "山城青谷", "山城多賀", "玉水", "棚倉", "上狛", "木津",
    ],
    "osakahigashi": [
        "新大阪", "南吹田", "ＪＲ淡路", "城北公園通", "ＪＲ野江", "鴫野", "放出", "高井田中央", "ＪＲ河内永和",
        "ＪＲ俊徳道", "ＪＲ長瀬", "衣摺加美北", "新加美", "久宝寺", "八尾",
    ],
    "osakaloop": [
        "大阪", "福島", "野田", "西九条", "弁天町", "大正", "芦原橋", "今宮", "新今宮", "天王寺",
        "寺田町", "桃谷", "鶴橋", "玉造", "森ノ宮", "大阪城公園", "京橋", "桜ノ宮", "天満",
    ],
    "sagano": [
        "京都", "梅小路京都西", "丹波口", "二条", "円町", "花園", "太秦", "嵯峨嵐山", "保津峡", "馬堀",
        "亀岡", "並河", "千代川", "八木", "吉富", "園部",
    ],
    "takarazuka": [
        "新大阪", "大阪", "塚本", "尼崎", "塚口", "猪名寺", "伊丹", "北伊丹", "川西池田", "中山寺",
        "宝塚", "生瀬", "西宮名塩", "武田尾", "道場", "三田", "新三田", "広野",
    ],
    "tozai": [
        "鴫野", "京橋", "大阪城北詰", "大阪天満宮", "北新地", "新福島", "海老江", "御幣島", "加島",
        "尼崎", "塚口", "立花",
    ],
    "yamatoji": [
        "ＪＲ難波", "今宮", "新今宮", "天王寺", "東部市場前", "平野", "加美", "久宝寺", "八尾", "志紀",
        "柏原", "高井田", "河内堅上", "三郷", "王寺", "法隆寺", "大和小泉", "郡山", "奈良",
        "平城山", "木津", "加茂", "笠置",
    ],
    "yumesaki": [
        "野田", "西九条", "安治川口", "ユニバーサルシティ", "桜島",
    ],
}

TARGET_LINES: set[str] = {
    "hokuriku",
    "kobesanyo",
    "hokurikubiwako",
    "kyoto",
    "ako",
    "kosei",
    "kusatsu",
    "nara",
    "sagano",
    "sanin1",
    "sanin2",
    "osakahigashi",
    "takarazuka",
}

TARGET_TYPES: set[str] = {"10", "63", "08"}  # 普通, 快速, う快速

TARGET_DIRECTIONS: set[int] = {0, 1}

LINE_PROFILE_URL = "https://api.line.me/v2/profile"

LINE_API_PUSH_URL = "https://api.line.me/v2/bot/message/push"